components/camel-soap/src/test/resources/org/apache/camel/dataformat/soap/SoapMarshalHeadersTest.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!--

    Licensed to the Apache Software Foundation (ASF) under one or more
    contributor license agreements.  See the NOTICE file distributed with
    this work for additional information regarding copyright ownership.
    The ASF licenses this file to You under the Apache License, Version 2.0
    (the "License"); you may not use this file except in compliance with
    the License.  You may obtain a copy of the License at

         http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.

-->
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cont="http://www.example.com/contact">
    <env:Header>
        <custom:comment
            env:actor="http://schemas.xmlsoap.org/soap/actor/next"
            env:mustUnderstand="0" xmlns:custom="http://www.example.com/soapheaders">gotcha</custom:comment>
    </env:Header>
    <env:Body>
        <cont:contact>
            <name>Smith</name>
            <numOrders>0</numOrders>
            <revenue>100000.0</revenue>
        </cont:contact>
    </env:Body>
</env:Envelope>